rocksdb/experiments/M2/results/20260429-025838/budget_off/run_3/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 03:17:25 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777432645186648 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.535 micros/op 117160 ops/sec 42.676 seconds 5000000 operations;  116.2 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      15.643 micros/op 63925 ops/sec 78.216 seconds 5000000 operations;   63.4 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      16.133 micros/op 61983 ops/sec 80.667 seconds 5000000 operations;   61.5 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      6/0   373.74 MB   1.5      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    435.5     34.33             24.12       240    0.143       0      0       0.0       0.0
  L1     26/1    1.61 GB   6.2     27.2    14.2     12.9      23.9     11.0       0.0   1.7    229.0    201.4    121.41             99.47        20    6.070     27M  3333K       0.0       0.0
  L2     96/2    4.49 GB   1.7     20.0     8.8     11.2      15.1      3.9       0.6   1.7    268.0    202.9     76.27             61.04       133    0.573     20M  4935K       0.0       0.0
 Sum    128/3    6.47 GB   0.0     47.1    23.0     24.1      53.6     29.5       0.6   3.7    208.0    236.5    232.01            184.62       393    0.590     47M  8269K       0.0       0.0
 Int      0/0    0.00 KB   0.0     47.1    23.0     24.1      53.3     29.2       0.6   3.7    208.5    236.0    231.42            184.14       389    0.595     47M  8269K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     47.1    23.0     24.1      39.0     14.9       0.0   0.0    244.1    202.0    197.68            160.51       153    1.292     47M  8269K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    435.5     34.33             24.12       240    0.143       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 201.6 total, 198.6 interval
Flush(GB): cumulative 14.597, interval 14.354
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 53.59 GB write, 272.25 MB/s write, 47.12 GB read, 239.38 MB/s read, 232.0 seconds
Interval compaction: 53.35 GB write, 275.11 MB/s write, 47.12 GB read, 243.00 MB/s read, 231.4 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 26, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 26, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 26, total-stops: 0
interval: 26 total count
Block cache LRUCache@0x55b732bbddf0#80890 capacity: 32.00 MB seed: 1231926360 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000165 secs_since: 201
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 201.6 total, 198.6 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 74.94 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 74.94 MB/s
Cumulative stall: 00:01:17.460 H:M:S, 38.4 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14774.87 MB, 74.41 MB/s
Interval WAL: 14M writes, 0 syncs, 14670997.00 writes per sync, written: 14.43 GB, 74.41 MB/s
Interval stall: 00:01:17.460 H:M:S, 39.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0